
Функция statementPOST(Запрос)
	ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	ОбрабатываемыеДанные = U_ПроцедурыРаботыСJSON.ПолучитьОбъектJSON(ТекстЗапроса);
	Если ОбрабатываемыеДанные.Свойство("type") И ОбрабатываемыеДанные.type = "StatementItem" Тогда
		U_ЗагрузкаВыгрузкаДанных.ОбработатьВебХукНовогоПлатежаМоноБанк(ОбрабатываемыеДанные);
	КонецЕсли;
	   	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция statementGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции
