#Область ЭмуляцияКонстант

#Область Монобанк

Процедура ПарольБанк_Сохранить(Значение) Экспорт
	СтароеЗначение = ПарольБанк_Получить();
	
	Если Не СтароеЗначение = Значение Тогда	
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПодсистемаОнлайнСтатистика", "ПарольБанк", Значение,, "ПодсистемаОнлайнСтатистика");
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
КонецПроцедуры

Функция ПарольБанк_Получить() Экспорт 
	Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодсистемаОнлайнСтатистика", "ПарольБанк", "",, "ПодсистемаОнлайнСтатистика");
	
	Возврат Значение;
КонецФункции

Процедура Идентификатор_Сохранить(Значение) Экспорт
	СтароеЗначение = Идентификатор_Получить();
	
	Если Не СтароеЗначение = Значение Тогда	
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПодсистемаОнлайнСтатистика", "Идентификатор", Значение,, "ПодсистемаОнлайнСтатистика");
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
КонецПроцедуры

Функция Идентификатор_Получить() Экспорт 
	Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодсистемаОнлайнСтатистика", "Идентификатор", "",, "ПодсистемаОнлайнСтатистика");
	
	Возврат Значение;
КонецФункции

Процедура ДатаПоследнейЗагрузки_Сохранить(Значение) Экспорт
	СтароеЗначение = ДатаПоследнейЗагрузки_Получить();
	
	Если Не СтароеЗначение = Значение Тогда	
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПодсистемаОнлайнСтатистика", "ДатаПоследнейСинхронизации", Значение,, "ПодсистемаОнлайнСтатистика");
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
КонецПроцедуры

Функция ДатаПоследнейЗагрузки_Получить() Экспорт 
	Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодсистемаОнлайнСтатистика", "ДатаПоследнейСинхронизации", Дата(1,1,1),, "ПодсистемаОнлайнСтатистика");
	
	Возврат Значение;
КонецФункции

Процедура АдресВебХукаМонобанк_Сохранить(Значение) Экспорт
	СтароеЗначение = АдресВебХукаМонобанк_Получить();
	
	Если Не СтароеЗначение = Значение Тогда	
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПодсистемаОнлайнСтатистика", "АдресВебХукаМонобанк", Значение,, "ПодсистемаОнлайнСтатистика");
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
КонецПроцедуры

Функция АдресВебХукаМонобанк_Получить() Экспорт 
	Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодсистемаОнлайнСтатистика", "АдресВебХукаМонобанк", "",, "ПодсистемаОнлайнСтатистика");
	
	Возврат Значение;
КонецФункции 

#КонецОбласти

Процедура АдресСерверСтатистики_Сохранить(Значение) Экспорт
	СтароеЗначение = АдресСерверСтатистики_Получить();
	
	Если Не СтароеЗначение = Значение Тогда	
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПодсистемаОнлайнСтатистика", "АдресСерверСтатистики", Значение,, "ПодсистемаОнлайнСтатистика");
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
КонецПроцедуры

Функция АдресСерверСтатистики_Получить() Экспорт 
	Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодсистемаОнлайнСтатистика", "АдресСерверСтатистики", "",, "ПодсистемаОнлайнСтатистика");
	
	Возврат Значение;
КонецФункции

Процедура ПортСерверСтатистики_Сохранить(Значение) Экспорт
	СтароеЗначение = ПортСерверСтатистики_Получить();
	
	Если Не СтароеЗначение = Значение Тогда	
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПодсистемаОнлайнСтатистика", "ПортСерверСтатистики", Значение,, "ПодсистемаОнлайнСтатистика");
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
КонецПроцедуры

Функция ПортСерверСтатистики_Получить() Экспорт 
	Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодсистемаОнлайнСтатистика", "ПортСерверСтатистики", 80,, "ПодсистемаОнлайнСтатистика");
	
	Возврат Значение;
КонецФункции

Процедура ПользовательСерверСтатистики_Сохранить(Значение) Экспорт
	СтароеЗначение = ПользовательСерверСтатистики_Получить();
	
	Если Не СтароеЗначение = Значение Тогда	
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПодсистемаОнлайнСтатистика", "ПользовательСерверСтатистики", Значение,, "ПодсистемаОнлайнСтатистика");
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
КонецПроцедуры

Функция ПользовательСерверСтатистики_Получить() Экспорт 
	Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодсистемаОнлайнСтатистика", "ПользовательСерверСтатистики", "",, "ПодсистемаОнлайнСтатистика");
	
	Возврат Значение;
КонецФункции

Процедура ПарольСерверСтатистики_Сохранить(Значение) Экспорт
	СтароеЗначение = ПарольСерверСтатистики_Получить();
	
	Если Не СтароеЗначение = Значение Тогда	
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПодсистемаОнлайнСтатистика", "ПарольСерверСтатистики", Значение,, "ПодсистемаОнлайнСтатистика");
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
КонецПроцедуры

Функция ПарольСерверСтатистики_Получить() Экспорт 
	Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодсистемаОнлайнСтатистика", "ПарольСерверСтатистики", "",, "ПодсистемаОнлайнСтатистика");
	
	Возврат Значение;
КонецФункции

Процедура HTTPSСерверСтатистики_Сохранить(Значение) Экспорт
	СтароеЗначение = HTTPSСерверСтатистики_Получить();
	
	Если Не СтароеЗначение = Значение Тогда	
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПодсистемаОнлайнСтатистика", "HTTPSСерверСтатистики", Значение,, "ПодсистемаОнлайнСтатистика");
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
КонецПроцедуры

Функция HTTPSСерверСтатистики_Получить() Экспорт 
	Значение = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодсистемаОнлайнСтатистика", "HTTPSСерверСтатистики", Ложь,, "ПодсистемаОнлайнСтатистика");
	
	Возврат Значение;
КонецФункции

#КонецОбласти
