
&НаСервере
Процедура КомандаЗарегистрироватьКОбработкеНаСервере()
	ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.U_ПрисоедененныеФайлыКОбработке.ПолучитьУзел());
	
	ОбновитьКоличествоЗарегистрированных();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗарегистрироватьКОбработке(Команда)
	КомандаЗарегистрироватьКОбработкеНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаобработатьВсеНаСервере()
	//U_ПрисоедененныеФайлы.ОбработатьПрисоедененныеДанные();
	ОбновитьКоличествоЗарегистрированных();
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обработка завершена");
КонецПроцедуры

&НаКлиенте
Процедура КомандаобработатьВсе(Команда)
	КомандаобработатьВсеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьКоличествоЗарегистрированных();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличествоЗарегистрированных()
	//КоличествоКОбработке = U_ПрисоедененныеФайлы.ПолучитьКоличествоЗарегистрированных();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьНастройки(Команда)
	ОткрытьФорму("ПланОбмена.U_ВыгрузкаОнлайнСтатистики.Форма.U_НастройкиПодсистемы", Новый Структура, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРегистрациюВсех(Команда)
	УдалитьРегистрациюВсехНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьРегистрациюВсехНаСервере()
	ПланыОбмена.УдалитьРегистрациюИзменений(ПланыОбмена.U_ПрисоедененныеФайлыКОбработке.ПолучитьУзел());
	
	ОбновитьКоличествоЗарегистрированных();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОдиночноеРегистрирование(Команда)
	ОткрытьФорму("ПланОбмена.U_ПрисоедененныеФайлыКОбработке.Форма.ФормаРегистрацииИзмененийКартинокНоменклатуры", Новый Структура, ЭтотОбъект,,,,Новый ОписаниеОповещения("РегистрацияИзменений_Окончание", ЭтотОбъект, Новый Структура), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияИзменений_Окончание(Результат, Параметры) Экспорт 
	ОбновитьКоличествоЗарегистрированных();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьДанные(Команда)
	ОбновитьКоличествоЗарегистрированных();
	Элементы.Список.Обновить();
КонецПроцедуры

//|%Остальнойсостав%
